app/controllers/students_controller.rb

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "students" SET "first_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Morgan"], ["updated_at", "2019-12-16 19:21:21.241308"], ["id", 1]]
---
    def update
        @student = Student.find_by(id: params[:id])
        @student.update(student_params(:first_name, :last_name))